InformationRegisters/RenaultFlotte_ИсторияКомментариев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>RenaultFlotte_ИсторияКомментариев</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Индексирование тел. номера для поиска</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_СостоянияСогласованияКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_СостоянияСогласованияКлиента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
			<Comment>Виды контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Основное взаимодействие с контрагентом - продажа, передача на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Основное взаимодействие с контрагентом - закупка и принятие на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Comment>Подотчетное лицо компании</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филиал</Name>
					<Comment>Филиал компании, одна из организаций</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственник</Name>
					<Comment>Собственник компании, осуществляющий финансирование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>Контактное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие контрагенты</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастныйПредприниматель</Name>
					<Comment>Частный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/RenaultFlotte_ОтправкаЗагрузкаКлиентов/Ext/Module.bsl
Процедура ОтправитьЗаявкуНаКлиента(КорпКлиентСсылка) Экспорт
	
	Прокси = RenaultFlotte_ОбщегоНазначения.ПолучитьПрокси();
	Данные = СформироватьСтруктуруДляПередачиКлиента(Прокси, КорпКлиентСсылка);
	Сервер = СтрокаСоединенияИнформационнойБазы();
	Прокси.PutClientRequestStructure(Данные, Сервер);
	
	Если Не РегистрыСведений.RenaultFlotte_ИсторияКомментариев.НайтиКомментарийПоОбъекту(
		КорпКлиентСсылка.ИдЗаявки,
		"Создана заявка на регистрацию") Тогда
		
		РегистрыСведений.RenaultFlotte_ИсторияКомментариев.ДобавитьКомментарий(
			КорпКлиентСсылка.ИдЗаявки,
			"Создана заявка на регистрацию",
			ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр);
			
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПакетДляПередачиКлиента(Прокси, КлиентСсылка)
	
	КлиентОбъект = КлиентСсылка.ПолучитьОбъект();
	
	XDTOКлиент = СоздатьОбъектXDTO(Прокси, "CorporateClient");
	Наименование = ПривестиНаименованиеВТребуемыйВид(КлиентОбъект.Наименование);
	XDTOКлиент.name = Наименование;
	XDTOКлиент.fullName = КлиентОбъект.Контрагент.НаименованиеПолное;
	XDTOКлиент.inn = КлиентОбъект.Контрагент.ИНН;
	XDTOКлиент.idReference = КлиентСсылка.УникальныйИдентификатор();
	Настройки = Renault_РаботаСПравамиПользователя.ПолучитьСписокПрав(КлиентОбъект.Автор);
	XDTOКлиент.idDealerCentre = Настройки.ДилерскийЦентр.УникальныйИдентификатор();
	XDTOКлиент.BIR = Настройки.ДилерскийЦентр.BIR;

	XDTOКлиент.idRequest = Неопределено;
	
	Если ЗначениеЗаполнено(КлиентСсылка.ИдЗаявки) Тогда
		XDTOКлиент.idRequest = КлиентСсылка.ИдЗаявки;
	КонецЕсли;
	
	Если КлиентОбъект.Автопарк.Количество() > 0 Тогда
		
		Для Каждого СтрокаАвтопарк из КлиентОбъект.Автопарк Цикл
			XDTOАвтопарк = СоздатьОбъектXDTO(Прокси, "CarInAutoPark");
			XDTOАвтопарк.marka = СтрокаАвтопарк.Марка;
			XDTOАвтопарк.model = СтрокаАвтопарк.Модель;
			XDTOАвтопарк.kolvo = СтрокаАвтопарк.Количество;
			XDTOКлиент.autopark.Добавить(XDTOАвтопарк);
		КонецЦикла;
		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Значение      = КлиентСсылка.Контрагент.Ссылка;
	НаборЗаписей.Отбор.Объект.Использование = Истина;
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		Для Каждого СтрокаНабораЗаписей из НаборЗаписей Цикл
			XDTOКонтактнаяИнформация = СоздатьОбъектXDTO(Прокси,"Contact");
			XDTOКонтактнаяИнформация.type = Строка(СтрокаНабораЗаписей.Тип);
			XDTOКонтактнаяИнформация.vid = СтрокаНабораЗаписей.Вид.Наименование;
			XDTOКонтактнаяИнформация.presentation = СтрокаНабораЗаписей.Представление;
			XDTOКлиент.contactInformation.Добавить(XDTOКонтактнаяИнформация);
		КонецЦикла;
	КонецЕсли;
	НаборЗаписей = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка,
	|	Контрагенты.Наименование,
	|	ЕСТЬNULL(Контрагенты.Должность.Наименование, """") КАК ДолжностьНаименование
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ВедушийКонтрагент = &ВедушийКонтрагент
	|	И Контрагенты.ВидОтношений = &ВидОтношений";
	Запрос.УстановитьПараметр("ВедушийКонтрагент", КлиентСсылка.Контрагент);
	Запрос.УстановитьПараметр("ВидОтношений", Справочники.ВидыВзаимоотношений.КонтактноеЛицо);
	
	Результат = Запрос.Выполнить();
	
	Если не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			XDTOКонтактноеЛицо = СоздатьОбъектXDTO(Прокси,"ContactPerson");
			XDTOКонтактноеЛицо.idReference = Выборка.Ссылка.УникальныйИдентификатор();
			XDTOКонтактноеЛицо.name = Выборка.Наименование;
			XDTOКонтактноеЛицо.position = Выборка.ДолжностьНаименование;
			НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Значение      = Выборка.Ссылка;
			НаборЗаписей.Отбор.Объект.Использование = Истина;
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() > 0 Тогда
				Для Каждого СтрокаНабораЗаписей из НаборЗаписей Цикл
					XDTOКонтактнаяИнформация = СоздатьОбъектXDTO(Прокси,"Contact");
					XDTOКонтактнаяИнформация.type = Строка(СтрокаНабораЗаписей.Тип);
					XDTOКонтактнаяИнформация.vid = СтрокаНабораЗаписей.Вид.Наименование;
					XDTOКонтактнаяИнформация.presentation = СтрокаНабораЗаписей.Представление;
					XDTOКонтактноеЛицо.contactInformation.Добавить(XDTOКонтактнаяИнформация);
				КонецЦикла;
			КонецЕсли;
			НаборЗаписей = Неопределено;
			XDTOКлиент.contactPersons.Добавить(XDTOКонтактноеЛицо);
		КонецЦикла;
	КонецЕсли;
	
	Если КлиентОбъект.СферыДеятельности.Количество() > 0 Тогда
		
		Для Каждого СтрокаСферыДеятельности из КлиентОбъект.СферыДеятельности Цикл
			XDTOСфераДеятельности = СоздатьОбъектXDTO(Прокси,"ActionSphere");
			XDTOСфераДеятельности.idReference = СтрокаСферыДеятельности.СфераДеятельности.УникальныйИдентификатор();
			XDTOКлиент.actionSpheres.Добавить(XDTOСфераДеятельности);
		КонецЦикла;
		
	КонецЕсли;
	
	Данные = ПолучитьДанныеДляПередачи(Прокси, XDTOКлиент);
	Возврат Данные;
	
КонецФункции

Функция ПривестиНаименованиеВТребуемыйВид(Знач Наименование) Экспорт
	
	Наименование = ВРег(Наименование);
	Наименование = СтрЗаменить(Наименование,"ООО","");
	Наименование = СтрЗаменить(Наименование,"ПАО","");
	Наименование = СтрЗаменить(Наименование,"ЗАО","");
	Наименование = СтрЗаменить(Наименование,"ТОО","");
	Наименование = СтрЗаменить(Наименование,"ИП","");
	Наименование = СтрЗаменить(Наименование,"АО","");
	Наименование = СтрЗаменить(Наименование,"""","");
	Возврат СокрЛП(Наименование);
	
КонецФункции

Функция ПолучитьДанныеДляПередачи(Прокси, ВходящиеДанные)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла, "UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Message");
	Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ВходящиеДанные);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть();
	ДвоичныеДанныеСообщения = Новый ДвоичныеДанные(ИмяВременногоФайла);
	ХранилищеЗначенияФайла = Новый ХранилищеЗначения(ДвоичныеДанныеСообщения, Новый СжатиеДанных(9));
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат ХранилищеЗначенияФайла;
	
КонецФункции

Функция СоздатьОбъектXDTO(Прокси, ТипОбъекта)
	
	Фабрика = Прокси.ФабрикаXDTO;
	Объект = Фабрика.Создать(
		Фабрика.Тип(
			"http://renault.ru/FlotteCentral", 
			ТипОбъекта));
	Возврат Объект;
	
КонецФункции

Процедура Renault_КорпоративныйКлиентПередЗаписьюПередЗаписью(Источник, Отказ) Экспорт
     	
	Если Источник.ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	Источник.ДополнительныеСвойства.Вставить("Состояние", Источник.Ссылка.Состояние);
	
КонецПроцедуры

Процедура Renault_КорпоративныйКлиентПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
     	
	Если Источник.ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	Если Источник.Состояние = Перечисления.Renault_СостоянияСогласованияКлиента.НаСогласовании
		или Источник.Состояние = Перечисления.Renault_СостоянияСогласованияКлиента.Согласован Тогда
		
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Источник.Ссылка);
		ФоновыеЗадания.Выполнить("RenaultFlotte_ОтправкаЗагрузкаКлиентов.ОтправитьЗаявкуНаКлиента", МассивПараметров);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьКорпоративныхКлиентов() Экспорт
	Попытка	
		УстановитьПривилегированныйРежим(Истина);
		
		Прокси = RenaultFlotte_ОбщегоНазначения.ПолучитьПрокси();
		
		Выборка = Справочники.CRM_ДилерскиеЦентры.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ОбъектXDTO = Прокси.GetClientCenter(Выборка.Ссылка.УникальныйИдентификатор());
			Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
			ТаблицаДанных = Сериализатор.ПрочитатьXDTO(ОбъектXDTO);
			
			МассивОбработанных = Новый Массив;
			
			Для Каждого Пакет из ТаблицаДанных Цикл
				ОбработатьПакет (Пакет, Прокси);
				МассивОбработанных.Добавить(Пакет.МоментВремени);
			КонецЦикла;
			
			МассивОбработанныхОбъектXDTO = Сериализатор.ЗаписатьXDTO(МассивОбработанных);
			
			Прокси.ConfirmProcessingClient(МассивОбработанныхОбъектXDTO, Выборка.Ссылка.УникальныйИдентификатор(), Выборка.BIR);
			
		КонецЦикла;
	Исключение
		Инфо = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(
		"КорпЗагрузкаДанных.ЗагрузитьКорпоративныхКлиентов",
		УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(Инфо));
	КонецПопытки;
КонецПроцедуры

Процедура ОбработатьПакет(ДанныеСообщения, Прокси)
	
	ДвоичныеДанныеФайла = ДанныеСообщения.Данные.Получить();
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
	ЧтениеXML.Прочитать();
	ЧтениеXML.Прочитать(); // пропуск тэга Message
	Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
		ТипXDTO = Прокси.ФабрикаXDTO.Тип(ДанныеСообщения.ПространствоИменДанных, ЧтениеXML.Имя);
		ОбъектXDTO = Прокси.ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипXDTO);
		СтрокаДляВыполнения = ДанныеСообщения.ИмяКомандыОбработки + "(ОбъектXDTO);";
		Выполнить(СтрокаДляВыполнения);
	КонецЦикла;
	ЧтениеXML.Закрыть();
	УдалитьФайлы(ИмяВременногоФайла);

КонецПроцедуры

Процедура ЗагрузитьКорпоративногоКлиента(ОбъектXDTO)
	
	//Создание-обновление данных клиента
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ИНН
		|	И Контрагенты.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ИНН", ОбъектXDTO.inn);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КонтрагентОбъект = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	КонецЕсли;
	Если КонтрагентОбъект.ЭтоНовый() Тогда
		КлиентОбъект = Справочники.Renault_КорпоративныеКлиенты.СоздатьЭлемент();
	иначе
		КлиентСсылка = Справочники.Renault_КорпоративныеКлиенты.НайтиПоРеквизиту("Контрагент", КонтрагентОбъект.Ссылка);
		Если КлиентСсылка <> Справочники.Renault_КорпоративныеКлиенты.ПустаяСсылка() Тогда
			КлиентОбъект = КлиентСсылка.ПолучитьОбъект();
		Иначе
			КлиентОбъект = Справочники.Renault_КорпоративныеКлиенты.СоздатьЭлемент();
		КонецЕсли;
	КонецЕсли;
	Если КлиентОбъект.ЭтоНовый() Тогда
		СсылкаКлиента = Справочники.Renault_КорпоративныеКлиенты.ПолучитьСсылку(ОбъектXDTO.idReference);
		КлиентОбъект.УстановитьСсылкуНового(СсылкаКлиента);
	КонецЕсли;
	
	Если ОбъектXDTO.autopark.Количество() > 0 Тогда 
		КлиентОбъект.Автопарк.Очистить();
	КонецЕсли;
	
	Если ОбъектXDTO.actionSpheres.Количество() > 0 Тогда 
		КлиентОбъект.СферыДеятельности.Очистить();
	КонецЕсли;
	
	КлиентОбъект.Наименование = ОбъектXDTO.name;
	КлиентОбъект.Состояние = Перечисления.Renault_СостоянияСогласованияКлиента.НаСогласовании;
	КлиентОбъект.ИдЗаявки = ОбъектXDTO.idRequest;
	КонтрагентОбъект.Наименование = ОбъектXDTO.name;
	КонтрагентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
	КонтрагентОбъект.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;
	КонтрагентОбъект.НаименованиеПолное = ОбъектXDTO.fullName;
	КонтрагентОбъект.ИНН = ОбъектXDTO.inn;
	
	Для Каждого СтрокаАвтопарка из ОбъектXDTO.autopark Цикл
		СтрокаАвтопаркаКлиента = КлиентОбъект.Автопарк.Добавить();
		СтрокаАвтопаркаКлиента.Марка = СтрокаАвтопарка.marka;
		СтрокаАвтопаркаКлиента.Модель = СтрокаАвтопарка.model;
		СтрокаАвтопаркаКлиента.Количество = СтрокаАвтопарка.kolvo;
	КонецЦикла;
	
	Для Каждого СтрокаСфераДеятельности из ОбъектXDTO.actionSpheres Цикл
		СтрокаСфераДеятельностиКлиента = КлиентОбъект.СферыДеятельности.Добавить();
		СтрокаСфераДеятельностиКлиента.СфераДеятельности = Справочники.Renault_СферыДеятельностиКлиентов.ПолучитьСсылку(СтрокаСфераДеятельности.idReference);
	КонецЦикла;
	Попытка
		КонтрагентОбъект.Записать();
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	КлиентОбъект.Контрагент = КонтрагентОбъект.Ссылка;
	КлиентОбъект.ОбменДанными.Загрузка = Истина;
	
	Попытка
		КлиентОбъект.Записать();
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗагрузитьСтатусыЗаявок() Экспорт
	Попытка	
		УстановитьПривилегированныйРежим(Истина);
		
		Прокси = RenaultFlotte_ОбщегоНазначения.ПолучитьПрокси();
		Выборка = Справочники.CRM_ДилерскиеЦентры.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбъектXDTO = Прокси.GetClientStatus(Выборка.Ссылка.УникальныйИдентификатор(), Выборка.BIR);
			Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
			ТаблицаДанных = Сериализатор.ПрочитатьXDTO(ОбъектXDTO);
			МассивОбработанных = Новый Массив;
			Для Каждого Пакет из ТаблицаДанных Цикл
				ДвоичныеДанныеФайла = Пакет.Данные.Получить();
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
				ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
				ЧтениеXML = Новый ЧтениеXML;
				ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
				ЧтениеXML.Прочитать();
				ЧтениеXML.Прочитать(); // пропуск тэга Message
				Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
					ТипXDTO = Прокси.ФабрикаXDTO.Тип(Пакет.ПространствоИменДанных, ЧтениеXML.Имя);
					ОбъектXDTO = Прокси.ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипXDTO); 
					Отказ = ЗагрузитьСтатусЗаявки(ОбъектXDTO);
				КонецЦикла;
				ЧтениеXML.Закрыть();
				УдалитьФайлы(ИмяВременногоФайла);
				Если Не Отказ Тогда
					МассивОбработанных.Добавить(Пакет.МоментВремени);
				КонецЕсли;
			КонецЦикла;
			МассивОбработанныхОбъектXDTO = Сериализатор.ЗаписатьXDTO(МассивОбработанных);
			Прокси.ConfirmProcessingClient(МассивОбработанныхОбъектXDTO, Выборка.Ссылка.УникальныйИдентификатор(), Выборка.BIR);
		КонецЦикла;
	Исключение
		Инфо = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(
		"КорпЗагрузкаДанных.ЗагрузитьСтатусыЗаявок",
		УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(Инфо));
		ВызватьИсключение;
	КонецПопытки;	
КонецПроцедуры

Функция ЗагрузитьСтатусЗаявки(ОбъектXDTO)
	
	КорпКлиент = Справочники.Renault_КорпоративныеКлиенты.НайтиПоРеквизиту("ИдЗаявки", ОбъектXDTO.idRequest);
	Если КорпКлиент = Справочники.Renault_КорпоративныеКлиенты.ПустаяСсылка() Тогда
		Возврат Истина;
	КонецЕсли;
	КорпКлиентОбъект = КорпКлиент.ПолучитьОбъект();
	Если ОбъектXDTO.isConfirned Тогда
		Состояние = Перечисления.Renault_СостоянияСогласованияКлиента.Согласован;
	Иначе
		Состояние = Перечисления.Renault_СостоянияСогласованияКлиента.НеСогласован;
	КонецЕсли;
	КорпКлиентОбъект.Состояние = Состояние;
	КорпКлиентОбъект.Идентификатор = ОбъектXDTO.idNumberClient;
	КорпКлиентОбъект.Записать();
	
	Renault_СообщенияПользователям.ПослатьСообщениеПользователю(
		Справочники.Renault_ВидСообщения.Корп_ИзменениеСтатусаЗаявкиНаКлиента,
		КорпКлиентОбъект.Менеджер,
		"Статус корп. клиента " + КорпКлиентОбъект.Наименование + " изменился на """ + Состояние + """");
	
	Возврат Ложь;
	
КонецФункции

Процедура RenaultFlotte_ОбщаяЗагрузкаВыгрузка(Параметр1 = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	RenaultFlotte_ОтправкаЗагрузкаЗаявокНаКорпСкидку.ОтправитьЗаявкиНаСогласование();
	RenaultFlotte_ОтправкаЗагрузкаЗаявокНаКорпСкидку.ЗагрузитьЗаявкиНаСкидку();
	RenaultFlotte_ОтправкаЗагрузкаКлиентов.ЗагрузитьКорпоративныхКлиентов();
	RenaultFlotte_ОтправкаЗагрузкаЗаявокНаКорпСкидку.ЗагрузитьСтатусыVIN();
	RenaultFlotte_ОтправкаЗагрузкаКлиентов.ЗагрузитьСтатусыЗаявок();
	RenaultFlotte_ОтправкаЗагрузкаЗаявокНаКорпСкидку.ЗагрузитьТаблицуКорпСкидок();
	RenaultFlotte_ЗагрузкаСправочников.RenaultFlotte_ЗагрузкаСправочников();
	RenaultFlotte_ОтправкаЗагрузкаКомментариев.RenaultFlotte_ОбменКомментариями();
	
КонецПроцедуры 

//Функция упаковывает данные клиента в структуру
//замена функции СформироватьПакетДляПередачиКлиента
Функция СформироватьСтруктуруДляПередачиКлиента(Прокси, КлиентСсылка)
	
	КлиентОбъект = КлиентСсылка.ПолучитьОбъект();
	
	ТаблКлиента = Новый Структура;
		
	Наименование = ПривестиНаименованиеВТребуемыйВид(КлиентОбъект.Наименование);
	ТаблКлиента.Вставить("name",		Наименование);
	ТаблКлиента.Вставить("fullName",	КлиентОбъект.Контрагент.НаименованиеПолное);
	ТаблКлиента.Вставить("inn",			КлиентОбъект.Контрагент.ИНН);
	ТаблКлиента.Вставить("idReference",	КлиентСсылка.УникальныйИдентификатор());
	
	Настройки = Renault_РаботаСПравамиПользователя.ПолучитьСписокПрав(КлиентОбъект.Автор);
	ТаблКлиента.Вставить("idDealerCentre",	Настройки.ДилерскийЦентр.УникальныйИдентификатор());
	ТаблКлиента.Вставить("BIR",	            Настройки.ДилерскийЦентр.BIR);
	ТаблКлиента.Вставить("PersInfo",		КлиентОбъект.ПерсДанные);
	ТаблКлиента.Вставить("advertisement",	КлиентОбъект.РассылкаРекламныхМатериалов);
	ТаблКлиента.Вставить("CorpPortal",		КлиентОбъект.РегистрацияНаКорпоративномПортале);
	
	Если ЗначениеЗаполнено(КлиентСсылка.ИдЗаявки) Тогда
		ТаблКлиента.Вставить("idRequest", КлиентСсылка.ИдЗаявки);
	КонецЕсли;
	
	Если КлиентОбъект.Автопарк.Количество() > 0 Тогда
		
		ТаблАвтопарк = Новый ТаблицаЗначений;
		ТаблАвтопарк.Колонки.Добавить("marka",);
		ТаблАвтопарк.Колонки.Добавить("model",);
		ТаблАвтопарк.Колонки.Добавить("kolvo",);
		
		Для Каждого СтрокаАвтопарк из КлиентОбъект.Автопарк Цикл
			СтрокаТаблАвтопарк = ТаблАвтопарк.Добавить();
			СтрокаТаблАвтопарк.marka = СтрокаАвтопарк.Марка.Наименование;
			СтрокаТаблАвтопарк.model = СтрокаАвтопарк.Модель;
			СтрокаТаблАвтопарк.kolvo = СтрокаАвтопарк.Количество;
		КонецЦикла;
		
		ТаблКлиента.Вставить("autopark", Новый ХранилищеЗначения(ТаблАвтопарк));
		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Значение      = КлиентСсылка.Контрагент.Ссылка;
	НаборЗаписей.Отбор.Объект.Использование = Истина;
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		
		ТаблКонтакты = Новый ТаблицаЗначений;
		ТаблКонтакты.Колонки.Добавить("type",);
		ТаблКонтакты.Колонки.Добавить("vid",);
		ТаблКонтакты.Колонки.Добавить("presentation",);
		
		Для Каждого СтрокаНабораЗаписей из НаборЗаписей Цикл
			СтрокаКонтактнаяИнформация = ТаблКонтакты.Добавить();
			СтрокаКонтактнаяИнформация.type = Строка(СтрокаНабораЗаписей.Тип);
			СтрокаКонтактнаяИнформация.vid = СтрокаНабораЗаписей.Вид.Наименование;
			СтрокаКонтактнаяИнформация.presentation = СтрокаНабораЗаписей.Представление;
		КонецЦикла;
		
		ТаблКлиента.Вставить("contactInformation", Новый ХранилищеЗначения(ТаблКонтакты));
		
	КонецЕсли;
	
	НаборЗаписей = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка,
	|	Контрагенты.Наименование,
	|	ЕСТЬNULL(Контрагенты.Должность.Наименование, """") КАК ДолжностьНаименование
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ВедушийКонтрагент = &ВедушийКонтрагент
	|	И Контрагенты.ВидОтношений = &ВидОтношений";
	Запрос.УстановитьПараметр("ВедушийКонтрагент", КлиентСсылка.Контрагент);
	Запрос.УстановитьПараметр("ВидОтношений", Справочники.ВидыВзаимоотношений.КонтактноеЛицо);
	
	Результат = Запрос.Выполнить();
	
	Если не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		ТаблКонтактноеЛицо = Новый ТаблицаЗначений;
		ТаблКонтактноеЛицо.Колонки.Добавить("idReference",);
		ТаблКонтактноеЛицо.Колонки.Добавить("name",);
		ТаблКонтактноеЛицо.Колонки.Добавить("position",);
		ТаблКонтактноеЛицо.Колонки.Добавить("contactInformation",);
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаКонтактноеЛицо = ТаблКонтактноеЛицо.Добавить();
			СтрокаКонтактноеЛицо.idReference = Выборка.Ссылка.УникальныйИдентификатор();
			СтрокаКонтактноеЛицо.name = Выборка.Наименование;
			СтрокаКонтактноеЛицо.position = Выборка.ДолжностьНаименование;
			НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Значение      = Выборка.Ссылка;
			НаборЗаписей.Отбор.Объект.Использование = Истина;
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() > 0 Тогда
				
				ТаблКонтактноеЛицоКонтакт = Новый ТаблицаЗначений;
				ТаблКонтактноеЛицоКонтакт.Колонки.Добавить("type",);
				ТаблКонтактноеЛицоКонтакт.Колонки.Добавить("vid",);
				ТаблКонтактноеЛицоКонтакт.Колонки.Добавить("presentation",);
				
				Для Каждого СтрокаНабораЗаписей из НаборЗаписей Цикл
					СтрокаКонтактноеЛицоКонтакт = ТаблКонтактноеЛицоКонтакт.Добавить();
					СтрокаКонтактноеЛицоКонтакт.type = Строка(СтрокаНабораЗаписей.Тип);
					СтрокаКонтактноеЛицоКонтакт.vid = СтрокаНабораЗаписей.Вид.Наименование;
					СтрокаКонтактноеЛицоКонтакт.presentation = СтрокаНабораЗаписей.Представление;
				КонецЦикла;
				
				СтрокаКонтактноеЛицо.contactInformation = Новый ХранилищеЗначения(ТаблКонтактноеЛицоКонтакт);
				
			КонецЕсли;
			
			НаборЗаписей = Неопределено;
			
		КонецЦикла;
		
		ТаблКлиента.Вставить("contactPersons", Новый ХранилищеЗначения(ТаблКонтактноеЛицо));
		
	КонецЕсли;
	
	Если КлиентОбъект.СферыДеятельности.Количество() > 0 Тогда
		
		ТаблСферыДеятельности = Новый ТаблицаЗначений;
		ТаблСферыДеятельности.Колонки.Добавить("idReference",);
		
		Для Каждого СтрокаСферыДеятельности из КлиентОбъект.СферыДеятельности Цикл
			СтрокаТабСфераДеятельности = ТаблСферыДеятельности.Добавить();
			СтрокаТабСфераДеятельности.idReference = СтрокаСферыДеятельности.СфераДеятельности.УникальныйИдентификатор();
		КонецЦикла;
		
		ТаблКлиента.Вставить("actionSpheres", Новый ХранилищеЗначения(ТаблСферыДеятельности));
		
	КонецЕсли;
	
	Данные = ПолучитьДанныеДляПередачи(Прокси, СериализаторXDTO.ЗаписатьXDTO(ТаблКлиента));
	Возврат Данные;
	
КонецФункции

//замена процедуры ЗагрузитьКорпоративногоКлиента
Процедура ЗагрузитьКорпоративногоКлиентаСтруктура(ОбъектXDTO)
	
	Табл = СериализаторXDTO.ПрочитатьXDTO(ОбъектXDTO);
	
	//Создание-обновление данных клиента
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ИНН
		|	И Контрагенты.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ИНН", Табл.inn);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КонтрагентОбъект = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	КонецЕсли;
	Если КонтрагентОбъект.ЭтоНовый() Тогда
		КлиентОбъект = Справочники.Renault_КорпоративныеКлиенты.СоздатьЭлемент();
	иначе
		КлиентСсылка = Справочники.Renault_КорпоративныеКлиенты.НайтиПоРеквизиту("Контрагент", КонтрагентОбъект.Ссылка);
		Если КлиентСсылка <> Справочники.Renault_КорпоративныеКлиенты.ПустаяСсылка() Тогда
			КлиентОбъект = КлиентСсылка.ПолучитьОбъект();
		Иначе
			КлиентОбъект = Справочники.Renault_КорпоративныеКлиенты.СоздатьЭлемент();
		КонецЕсли;
	КонецЕсли;
	Если КлиентОбъект.ЭтоНовый() Тогда
		СсылкаКлиента = Справочники.Renault_КорпоративныеКлиенты.ПолучитьСсылку(Табл.idReference);
		КлиентОбъект.УстановитьСсылкуНового(СсылкаКлиента);
	КонецЕсли;
	
	autopark = Табл.autopark.Получить();
	
	Если autopark.Количество() > 0 Тогда 
		КлиентОбъект.Автопарк.Очистить();
	КонецЕсли;
	
	actionSpheres = Табл.actionSpheres.Получить();
	
	Если actionSpheres.Количество() > 0 Тогда 
		КлиентОбъект.СферыДеятельности.Очистить();
	КонецЕсли;
	
	КлиентОбъект.Наименование = Табл.name;
	КлиентОбъект.Состояние = Перечисления.Renault_СостоянияСогласованияКлиента.НаСогласовании;
	КлиентОбъект.ИдЗаявки = Табл.idRequest;
	КонтрагентОбъект.Наименование = Табл.name;
	КонтрагентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
	КонтрагентОбъект.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;
	КонтрагентОбъект.НаименованиеПолное = Табл.fullName;
	КонтрагентОбъект.ИНН = Табл.inn;
	
	Для Каждого СтрокаАвтопарка из autopark Цикл
		СтрокаАвтопаркаКлиента = КлиентОбъект.Автопарк.Добавить();
		СтрокаАвтопаркаКлиента.Марка = СтрокаАвтопарка.marka;
		СтрокаАвтопаркаКлиента.Модель = СтрокаАвтопарка.model;
		СтрокаАвтопаркаКлиента.Количество = СтрокаАвтопарка.kolvo;
	КонецЦикла;
	
	Для Каждого СтрокаСфераДеятельности из actionSpheres Цикл
		СтрокаСфераДеятельностиКлиента = КлиентОбъект.СферыДеятельности.Добавить(); 
		СтрокаСфераДеятельностиКлиента.СфераДеятельности = Справочники.Renault_СферыДеятельностиКлиентов.ПолучитьСсылку(СтрокаСфераДеятельности.idReference);
	КонецЦикла;
	Попытка
		КонтрагентОбъект.Записать();
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	КлиентОбъект.Контрагент = КонтрагентОбъект.Ссылка;
	
	КлиентОбъект.ОбменДанными.Загрузка = Истина;
	
	Попытка
		КлиентОбъект.Записать();
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ПоискКонтрагентаВDictionary(ИНН) Экспорт
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		Возврат Новый Структура;
	КонецЕсли;
	
	Прокси = RenaultFlotte_ПолучитьПрокси();
	
	ДанныеКлиента = Прокси.GetCorpClientFromDictionary(ИНН);
	
	Возврат СериализаторXDTO.ПрочитатьXDTO(ДанныеКлиента);
	
КонецФункции

Функция RenaultFlotte_ПолучитьПрокси()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	
	АдресWS = Настройки.КЦАдресСервера;
	
	СообщениеОбОшибке = "";
	
	ВСОпределение = Новый WSОпределения(СокрЛП(АдресWS) + "ws/Flotte.1cws?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	
	ВебСервис = Новый WSПрокси(
		ВСОпределение, 
		"http://renault.ru/FlotteCentral", 
		"Renault_Flotte", 
		"Renault_FlotteSoap12", 
		3600);
		
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	
	Возврат ВебСервис;
	
КонецФункции
